data/001_box/run001_of13/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          12;
        startFace       908;
    }
    side
    {
        type            wall;
        nFaces          80;
        startFace       920;
    }
    topAndbottom
    {
        type            empty;
        nFaces          960;
        startFace       1000;
    }
    outlet
    {
        type            patch;
        nFaces          12;
        startFace       1960;
    }
)

// ************************************************************************* //
